_posts/2015-04-24-Commenting-in-org-files.html
---
title: Commenting in org-files
date: 2015/04/24 12:41:39
updated: 2015/11/19 09:22:50
categories: org
tags: 
---


<p>
There was an interesting discussion on the org-mode mail list about putting comments in org files. Eric Fraga suggested using inline tasks, and customizing the export of them so they make a footnote, or use the todonotes package (suggested by Marcin Borkowski). Here is Eric's export. A big advantage of this is integration with the Agenda, so you can see what there is todo in your document.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">  (<span style="color: #0000FF;">setq</span> org-inlinetask-export-templates
        '((latex <span style="color: #008000;">"%s\\footnote{%s\\\\ %s}\\marginpar{\\fbox{\\thefootnote}}"</span>
                 '((<span style="color: #0000FF;">unless</span>
                       (eq todo <span style="color: #008000;">""</span>)
                     (format <span style="color: #008000;">"\\fbox{\\textsc{%s%s}}"</span> todo priority))
                   heading content))))
</pre>
</div>

<p>
Eric Abrahamsen suggested an idea to use a link syntax. I like the idea a lot, so here we develop some ideas. A link has two parts, the path, and description. A simple comment would just be a simple link, probably in double square brackets so you can have spaces in your comment. <font color="red"><abbr title="Why do you think there are only two parts" color="red">COMMENT</abbr></font>  It might be feasible to use <font color="red"><abbr title="Why do you quote mark?" color="red">COMMENT</abbr></font> the description to "mark text" that the comment refers to. The remaining question is what functionality should our link have when you click on it, and how to export it. For functionality, a click will show the comment in the minibuffer and offer to delete it. For export, for now we will make it export with todonotes in LaTeX, and as a red COMMENT with a tooltip in html. To use this, you need to have the LaTeX package todonotes included in your org file.
</p>
<p>
Here is our comment link.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-add-link-type
 <span style="color: #008000;">"comment"</span>
 (<span style="color: #0000FF;">lambda</span> (linkstring)
   (<span style="color: #0000FF;">let</span> ((elm (org-element-context))
         (use-dialog-box nil))
     (<span style="color: #0000FF;">when</span> (y-or-n-p <span style="color: #008000;">"Delete comment? "</span>)
       (<span style="color: #0000FF;">setf</span> (buffer-substring
              (org-element-property <span style="color: #006FE0;">:begin</span> elm)
              (org-element-property <span style="color: #006FE0;">:end</span> elm))
             (<span style="color: #0000FF;">cond</span>
              ((org-element-property <span style="color: #006FE0;">:contents-begin</span> elm)
               (buffer-substring
                (org-element-property <span style="color: #006FE0;">:contents-begin</span> elm)
                (org-element-property <span style="color: #006FE0;">:contents-end</span> elm)))
              (t
               <span style="color: #008000;">""</span>))))))
 (<span style="color: #0000FF;">lambda</span> (keyword desc format)
   (<span style="color: #0000FF;">cond</span>
    ((eq format 'html)
     (format <span style="color: #008000;">"&lt;font color=\"red\"&gt;&lt;abbr title=\"%s\" color=\"red\"&gt;COMMENT&lt;/abbr&gt;&lt;/font&gt; %s"</span> keyword (<span style="color: #0000FF;">or</span> desc <span style="color: #008000;">""</span>)))
    ((eq format 'latex)
     (format <span style="color: #008000;">"\\todo{%s}{%s}"</span> keyword (<span style="color: #0000FF;">or</span> desc <span style="color: #008000;">""</span>))))))
</pre>
</div>


<p>
It would be convenient to have a quick function for adding a comment to some highlighted text.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">add-comment</span> (begin end)
  (<span style="color: #0000FF;">interactive</span> <span style="color: #008000;">"r"</span>)
  (<span style="color: #0000FF;">if</span> (region-active-p)
      (<span style="color: #0000FF;">let</span> ((selected-text (buffer-substring begin end)))
        (<span style="color: #0000FF;">setf</span> (buffer-substring begin end)
              (format <span style="color: #008000;">"[[comment:%s][%s]]"</span>
                      (read-input <span style="color: #008000;">"Comment: "</span>) selected-text)))
  (insert (format  <span style="color: #008000;">"[[comment:%s]]"</span> (read-input <span style="color: #008000;">"Comment: "</span>)))))
</pre>
</div>

<p>
Test 1: <font color="red"><abbr title="test comment" color="red">COMMENT</abbr></font> 
</p>

<p>
<font color="red"><abbr title="You seem to have forgotten Test 2" color="red">COMMENT</abbr></font> Test 2
</p>

<p>
That is it. I could see a few other enhancements that might be very useful, e.g. a command to list all the comments, remove all the comments, etc&#x2026; I am pretty satisfied with this for now though.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> An updated approach to comments.</h2>
<div class="outline-text-2" id="text-1">
<p>
Rainer asked about making some comments inline. It would be nice if a single link syntax could accommodate both styles of comments. I previously developed an approach to extend links with attributes (<a href="http://kitchingroup.cheme.cmu.edu/blog/2015/02/05/Extending-the-org-mode-link-syntax-with-attributes/">http://kitchingroup.cheme.cmu.edu/blog/2015/02/05/Extending-the-org-mode-link-syntax-with-attributes/</a> ), which I will reuse here for that purpose. The idea is to add an ":inline" attribute to change the export behavior. We only modify the LaTeX export here.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(org-add-link-type
 <span style="color: #008000;">"comment"</span>
 <span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">follow function</span>
(<span style="color: #0000FF;">lambda</span> (linkstring)
   (<span style="color: #0000FF;">let</span> ((elm (org-element-context))
         (use-dialog-box nil))
     (<span style="color: #0000FF;">when</span> (y-or-n-p <span style="color: #008000;">"Delete comment? "</span>)
       (<span style="color: #0000FF;">setf</span> (buffer-substring
              (org-element-property <span style="color: #006FE0;">:begin</span> elm)
              (org-element-property <span style="color: #006FE0;">:end</span> elm))
             (<span style="color: #0000FF;">cond</span>
              ((org-element-property <span style="color: #006FE0;">:contents-begin</span> elm)
               (buffer-substring
                (org-element-property <span style="color: #006FE0;">:contents-begin</span> elm)
                (org-element-property <span style="color: #006FE0;">:contents-end</span> elm)))
              (t
               <span style="color: #008000;">""</span>))))))
 <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">format function</span>
 (<span style="color: #0000FF;">lambda</span> (path description format)
   (<span style="color: #0000FF;">let*</span> ((data (read (concat <span style="color: #008000;">"("</span> path <span style="color: #008000;">")"</span>)))
          (head (car data))
          (plist (cdr data)))
     (<span style="color: #0000FF;">cond</span>
      ((eq format 'html)
       (format <span style="color: #008000;">"&lt;font color=\"red\"&gt;&lt;abbr title=\"%s\" color=\"red\"&gt;COMMENT&lt;/abbr&gt;&lt;/font&gt; %s"</span> path (<span style="color: #0000FF;">or</span> description <span style="color: #008000;">""</span>)))
      ((eq format 'latex)
       (format <span style="color: #008000;">"\\todo%s{%s}%s"</span>
               (<span style="color: #0000FF;">if</span> (-contains? data <span style="color: #006FE0;">:inline</span>) <span style="color: #008000;">"[inline]"</span> <span style="color: #008000;">""</span>)
               (mapconcat (<span style="color: #0000FF;">lambda</span> (s)
                            (format <span style="color: #008000;">"%s"</span> s))
                          (-remove-item <span style="color: #006FE0;">:inline</span> data) <span style="color: #008000;">" "</span>)
               (<span style="color: #0000FF;">if</span> description (format <span style="color: #008000;">"{%s}"</span> description) <span style="color: #008000;">""</span>)))))))
</pre>
</div>

<p>
Here are some examples of the syntax:
</p>
<pre class="example">
[[comment: :inline the rest of your text]]

[[comment:Some text you want to highlight]]

[[comment:Some text you want to highlight :inline]]
</pre>

<p>
It doesn't matter where the :inline attribute is added. This seems to work pretty well.
</p>

<p>
We can modify our convenience function to allow us to use a prefix arg to make the comment inline. Here is one way to do it.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">defun</span> <span style="color: #006699;">add-comment</span> (begin end <span style="color: #6434A3;">&amp;optional</span> arg)
  <span style="color: #036A07;">"Comment the region. With a prefix ARG, make the comment inline."</span>
  (<span style="color: #0000FF;">interactive</span> (list (region-beginning)
                     (region-end)
                     current-prefix-arg))
  (<span style="color: #0000FF;">let</span> ((<span style="color: #0000FF;">inline</span> (<span style="color: #0000FF;">if</span> arg <span style="color: #008000;">":inline "</span> <span style="color: #008000;">""</span>)))
        (<span style="color: #0000FF;">if</span> (region-active-p)
            (<span style="color: #0000FF;">let</span> ((selected-text (buffer-substring begin end)))
              (<span style="color: #0000FF;">setf</span> (buffer-substring begin end)
                    (format
                     <span style="color: #008000;">"[[comment:%s%s][%s]]"</span>
                     inline
                     (read-input <span style="color: #008000;">"Comment: "</span>) selected-text)))
          (insert (format
                   <span style="color: #008000;">"[[comment:%s%s]]"</span>
                   inline
                   (read-input <span style="color: #008000;">"Comment: "</span>))))))
</pre>
</div>

<pre class="example">
add-comment
</pre>

<p>
Test <font color="red"><abbr title="a new regular comment" color="red">COMMENT</abbr></font> text to  <font color="red"><abbr title=":inline an inline comment" color="red">COMMENT</abbr></font> comment on.
</p>
</div>
</div>
<p>Copyright (C) 2015 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2015/04/24/Commenting-in-org-files.org">org-mode source</a><p><p>Org-mode version = 8.2.10</p>